#include <iostream>
#include "Student.h"
using namespace std;
//
//Створити клас Учень з полями  прізвище(рядок), клас(ціле число або рядок), кількість оцінок, оцінки(динамічний масив оцінок), максимальна та мінімальна допустима оцінки(можна  глобальні константи).
//Визначити методи

//метод виставлення(виправлення) оцінки учню за певний предмет(індекс), перевіряти на коректність номер оцінки(предмету) та саму оцінку;
//метод обчислення середнього балу учня(дробове число);
//*метод додавання в кінець масиву нової оцінки(масив оцінок повинен розширюватися, число оцінок збільшуватися).



int main()
{
	Student student("Josepth", "11-B", 300);
	cout << "\n\n========= Student ========\n";
	student.print();
	system("pause");
}